app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings

    #Problem 1 - sorting with yellow highlighting
    @sort = params[:sort] || session[:sort]
    if (@sort == "title")
      @title_header = "hilite"
    end
    if (@sort == "release_date")
      @release_date_header = "hilite"
    end

    session[:sort] = @sort

    #Problem 2 - filtering with checkboxes
    @param_ratings = params[:ratings] || session[:rating]
    if @param_ratings
      @ratings = @param_ratings.keys
      @movies = Movie.find(:all, :order => @sort, :conditions =>["movies.rating IN (?)", @ratings])
    else
      @param_ratings = {}
      @all_ratings.each do |rating|
---
SELECT "movies".* FROM "movies" WHERE (movies.rating IN ('PG','PG-13','R')) ORDER BY title
SELECT "movies".* FROM "movies" ORDER BY release_date